In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
#construct DataFrame using dict:

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],        
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

df = DataFrame(data)
df

#columns will be in sorted order, u can specify them though

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [5]:
#specifying columns' order

DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
#passing a column that's not part of the data will get filled with NaNs

df2 = DataFrame(data, columns=['year','state','pop', 'debt'],
               index=['one','two','three','four','five'])
df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [8]:
#displaying column's 

df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [12]:
#DataFrame can be retrieved as Series either by dict-like notation or by attribute
print(df['state'])
print(df2.year)

#returned Series have the same index as the dataframe, and their name is appropriately set

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [14]:
#retrieving rows (as Series)

df2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [18]:
#modifying columns by assigning scalar value

df2.debt = 16.5     #df2['debt'] = 16.5
df2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [17]:
#modifying column by assigning array
df2.debt = np.arange(5.)
df2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [21]:
#when assigning list or arrays to columns, the must match the length of the DataFrame
#if assigning Series, it will be conformed to the DF's index, iserting NaNs for missing values

val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df2.debt = val
df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [22]:
#assigning columnthat doesn't exist will create a new column. 
#del deletes column, as with a dict

df2['eastern'] = df2.state == 'Ohio'
df2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [25]:
del df2.eastern       #wrong
del df2['eastern']    #works only when written "dict-like". same as creation of new columns

df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [57]:
columns_new = df2.columns
test= df2.ix[:,-2]
print (test)
index_new = df2.index[:-1]     #slicing index
index_new

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
Name: pop, dtype: float64

Index(['one', 'two', 'three', 'four'], dtype='object')

In [58]:
new_frame = DataFrame(np.arange(16).reshape(4,4), columns=columns,
                     index=index_new)
new_frame

       year  state  pop  debt
one       0      1    2     3
two       4      5    6     7
three     8      9   10    11
four     12     13   14    15

### passing nested dict as data. outer keys interpreted as columns, inner keys as row index

In [74]:
nested = {'Nevada': {2001: 2.4, 2002: 2.9},   
          'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [62]:
frame3 = DataFrame(nested)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### #Transpose DataFrame

In [73]:
frame3.T

year    2000  2001  2002
state
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

### if explicit index is specified, keys in inner dicts will be ignored as index name

In [72]:
DataFrame(nested,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

### dicts of series treated much in the same way:

In [66]:

pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][1:]}

DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   NaN

### Set name attributes of DataFrames index and columns:

In [70]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [69]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

### Like Series, the values attribute retunrs the data contained as a 2D ndarray

In [71]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])